Revit 2027 API
Transform.IsIdentity Property
The boolean value that indicates whether this transformation is an identity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsIdentity { get; }
Public ReadOnly Property IsIdentity As Boolean
	Get
public:
property bool IsIdentity {
	bool get ();
}
member IsIdentity : bool with get
Property Value
Boolean
Remarks
 The identity transformation does not change a point or a vector that it is applied to.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace